examples/pinhole50/0/A
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      A;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0.0003261 0 0 0.0003261 0 0.0003261); //  = 1/(3N)

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.0003261 0 0 0.0003261 0 0.0003261);
    }
    
    outlet
    {
        type            zeroGradient;
    }

    wedge_neg
    {
        type            symmetryPlane; //wedge;
    }
    
    wedge_pos
    {
        type            symmetryPlane;
    } 
}

// ************************************************************************* //
