examples/pinhole50/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       44791;
    }
    inlet
    {
        type            patch;
        nFaces          248;
        startFace       44919;
    }
    wall
    {
        type            patch;
        nFaces          170;
        startFace       45167;
    }
    wedge_neg
    {
        type            symmetryPlane;
        nFaces          22577;
        startFace       45337;
    }
    wedge_pos
    {
        type            symmetryPlane;
        nFaces          22577;
        startFace       67914;
    }
)

// ************************************************************************* //
