examples/pinhole50/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          simple;

simpleCoeffs
{
    n           ( 8 1 1 );
    delta       0.001;
}


hierarchicalCoeffs
{ 
    n           ( 8 1 1 );
    delta       0.001;
    order       xyz;
}

scotchCoeffs
{
    //processorWeights (1 1 1 1)
}

manualCoeffs
{ 
    dataFile    "";
} 

distributed     no;

roots           ( );



// ************************************************************************* //
